<!-- dflook/terraform-github-actions {"workspace":"trixie-2","backend_type":"remote","backend":"fc606d18cdb04bc6c626a284b7653b7b5d9aeda3a26845125173f4bdb755b33d","plan_job_ref":"Job Test Terraform cloud #377 at https://github.com/dflook/terraform-github-actions/actions/runs/23685838915","plan_hash":"bbaed5e0925561b97e511d2e0d0fec5d5cd407c7eee62e3cf952bb26cadd3eb3","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __trixie-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #377](https://github.com/dflook/terraform-github-actions/actions/runs/23685838915)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>